OpenDTEF-v2012/tutorials/combustion/fireFoam/LES/smallPoolFire2D/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication topoSet
runApplication createPatch -overwrite

cp 0/ph_rgh.orig 0/ph_rgh

runApplication $(getApplication)

#------------------------------------------------------------------------------
